CopyOfRolecall_To_Fusion/Files/RoleCall_FU/Fusion/Organization/Update/Request/UpdateOrganization.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/cdm/foundation/parties/organizationService/applicationModule/types/" xmlns:ns1="http://xmlns.oracle.com/apps/cdm/foundation/parties/organizationService/" >
   <soapenv:Header/>
   <soapenv:Body>
      <typ:updateOrganization>
         <typ:organizationParty>
			  <ns1:RequestId>777777777777777</ns1:RequestId>
               <ns1:PartyNumber>M000103</ns1:PartyNumber>
               <ns1:PartyId>300000003009608</ns1:PartyId>
               <ns1:OrganizationProfile>
               <ns1:OrganizationName>MagicSoft_01</ns1:OrganizationName>
               </ns1:OrganizationProfile>
            <ns1:PartySite xmlns:ns6="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/"> 
        		<ns6:LocationId>300000001613421</ns6:LocationId>
               <ns6:PartySiteNumber>Mg03</ns6:PartySiteNumber>
               <ns6:PartySiteName>Mg03</ns6:PartySiteName>
            </ns1:PartySite>
             <ns1:PartySite xmlns:ns6="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/"> 
        		<ns6:LocationId>300000003009122</ns6:LocationId>
               <ns6:PartySiteNumber>Mg04</ns6:PartySiteNumber>
               <ns6:PartySiteName>Mg04</ns6:PartySiteName>
            </ns1:PartySite>
          </typ:organizationParty>
         </typ:updateOrganization>
   </soapenv:Body>
</soapenv:Envelope>